active_record/url_shortener/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "_hfE2M5WbjWDB8YgbRt8NQ"], ["submitter_id", 1], ["created_at", "2019-07-04 22:47:35.568843"], ["updated_at", "2019-07-04 22:47:35.568843"]]
---
  def self.prune(n)
    ShortenedUrl
      .joins(:submitter) #'JOIN users ON users.id = shortened_urls.submitter_id'
      .joins('LEFT JOIN visits ON visits.shortened_url_id = shortened_urls.id')
      .where("(shortened_urls.id IN (
        SELECT shortened_urls.id
        FROM shortened_urls
        JOIN visits
        ON visits.shortened_url_id = shortened_urls.id
        GROUP BY shortened_urls.id
        HAVING MAX(visits.created_at) < \'#{n.minute.ago}\'
      ) OR (
        visits.id IS NULL and shortened_urls.created_at < \'#{n.minutes.ago}\'
      )) AND users.premium = \'f\'")
      .destroy_all